Repository: sidey-app/SIDEY-source
Catalog: macos/SIDEY/Resources/Localizable.xcstrings
Source language: en
Languages: ja, ko, zh_hant

# account.delete.failed
source: Couldn’t delete your account.
ja: アカウントを削除できませんでした。
ko: 계정 탈퇴에 실패했습니다.
zh_hant: 無法刪除帳號。

# account_delete.error.request_failed
source: Couldn’t complete the account deletion request.
ja: アカウント削除リクエストを完了できませんでした。
ko: 계정 삭제 요청을 완료하지 못했습니다.
zh_hant: 無法完成刪除帳號的要求。

# apple_auth.error.missing_authorization_code
source: A new Apple authorization code is required to delete your account.
ja: アカウントを削除するには、新しいApple認証コードが必要です。
ko: 계정 탈퇴에는 새로운 Apple 인증 코드가 필요합니다.
zh_hant: 刪除帳號需要新的 Apple 授權碼。

# apple_auth.error.missing_identity_token
source: The Sign in with Apple response did not include an identity token.
ja: Appleでサインインの応答にidentity tokenが含まれていません。
ko: Apple 로그인 응답에 identity token이 없습니다.
zh_hant: 使用 Apple 登入的回應中沒有 identity token。

# apple_auth.error.missing_request_nonce
source: The Sign in with Apple response did not include the request nonce.
ja: Appleでサインインの応答にリクエストnonceが含まれていません。
ko: Apple 로그인 응답에 요청 nonce가 없습니다.
zh_hant: 使用 Apple 登入的回應中沒有要求 nonce。

# auth.apple.description
source: The App Store version requires Sign in with Apple to restore purchases and protect your account.
ja: 購入の復元とアカウント保護のため、App Store版ではAppleでのサインインが必要です。
ko: 구매 복원과 계정 보호를 위해 App Store 버전은 Apple 로그인이 필요합니다.
zh_hant: 為了還原購買項目並保護帳號，App Store 版本需要使用 Apple 登入。

# auth.apple.title
source: Start SIDEY with Apple
ja: AppleでSIDEYを始める
ko: Apple로 SIDEY 시작하기
zh_hant: 使用 Apple 開始使用 SIDEY

# auth.apple.verifying
source: Verifying sign-in
ja: サインインを確認中
ko: 로그인 확인 중
zh_hant: 正在確認登入

# auth.apple_sign_in.failed
source: Couldn’t sign in with Apple.
ja: Appleでサインインできませんでした。
ko: Apple 로그인에 실패했습니다.
zh_hant: 無法使用 Apple 登入。

# backend.connect.failed_detail
source: Couldn’t connect to the server: %@
ja: サーバーに接続できませんでした：%@
ko: 서버 연결 실패: %@
zh_hant: 無法連線至伺服器：%@

# backend.connection.connecting
source: Connecting
ja: 接続中
ko: 연결 중
zh_hant: 連線中

# backend.connection.failed
source: Connection Error
ja: 接続エラー
ko: 연결 오류
zh_hant: 連線錯誤

# backend.connection.idle
source: Waiting
ja: 待機中
ko: 대기 중
zh_hant: 等待中

# backend.connection.online
source: Connected
ja: 接続済み
ko: 연결됨
zh_hant: 已連線

# backend.error.already_member
source: You’ve already joined this group.
ja: すでに参加しているグループです。
ko: 이미 참여 중인 그룹입니다.
zh_hant: 你已加入這個群組。

# backend.error.authentication_required
source: No authentication session is available.
ja: 認証セッションがありません。
ko: 인증 세션이 없습니다.
zh_hant: 目前沒有驗證工作階段。

# backend.error.current_user_unavailable
source: Couldn’t verify the current user.
ja: 現在のユーザー情報を確認できませんでした。
ko: 현재 사용자 정보를 확인하지 못했습니다.
zh_hant: 無法確認目前的使用者資訊。

# backend.error.generic
source: Couldn’t complete the request. Please try again later.
ja: リクエストを完了できませんでした。しばらくしてからもう一度お試しください。
ko: 요청을 처리하지 못했습니다. 잠시 후 다시 시도해 주세요.
zh_hant: 無法完成要求，請稍後再試。

# backend.error.invalid_invite_code
source: Check the invite code and try again.
ja: 招待コードを確認して、もう一度お試しください。
ko: 초대 코드를 다시 확인해 주세요.
zh_hant: 請確認邀請碼後再試一次。

# backend.error.invalid_message
source: Enter a message with no more than 200 characters and 3 lines.
ja: メッセージは200文字・3行以内で入力してください。
ko: 메시지는 200자·3줄 이하로 입력해 주세요.
zh_hant: 訊息請勿超過 200 個字元及 3 行。

# backend.error.invalid_profile
source: Enter a nickname of 2–8 characters without line breaks.
ja: ニックネームは改行なしの2〜8文字で入力してください。
ko: 닉네임은 줄바꿈 없이 2~8자로 입력해 주세요.
zh_hant: 暱稱請輸入 2 至 8 個字元，且不要換行。

# backend.error.invalid_room_name
source: Enter a group name of 1–20 characters without line breaks.
ja: グループ名は改行なしの1〜20文字で入力してください。
ko: 그룹 이름은 줄바꿈 없이 1~20자로 입력해 주세요.
zh_hant: 群組名稱請輸入 1 至 20 個字元，且不要換行。

# backend.error.invalid_timestamp
source: Couldn’t read the message time from the server.
ja: サーバーのメッセージ時刻を読み取れませんでした。
ko: 서버 메시지 시각을 해석하지 못했습니다.
zh_hant: 無法解析伺服器上的訊息時間。

# backend.error.invite_rate_limited
source: Too many invite code attempts. Try again in 10 minutes.
ja: 招待コードの試行回数が多すぎます。10分後にもう一度お試しください。
ko: 초대 코드 시도가 너무 많습니다. 10분 뒤 다시 시도해 주세요.
zh_hant: 嘗試邀請碼的次數過多，請在 10 分鐘後再試。

# backend.error.malformed_response
source: Couldn’t read the server response.
ja: サーバーからの応答を読み取れませんでした。
ko: 서버 응답 형식을 해석하지 못했습니다.
zh_hant: 無法解析伺服器回應。

# backend.error.member_limit_reached
source: This group is already full with %lld members.
ja: このグループはすでに%lld人で満員です。
ko: 이 그룹은 이미 %lld명으로 가득 찼습니다.
zh_hant: 這個群組已有 %lld 位成員，名額已滿。

# backend.error.member_not_found
source: Couldn’t find the member to remove.
ja: 削除するメンバーが見つかりませんでした。
ko: 내보낼 멤버를 찾지 못했습니다.
zh_hant: 找不到要移除的成員。

# backend.error.membership_required
source: Only members of this group can do that.
ja: この操作はグループのメンバーのみ実行できます。
ko: 이 그룹의 멤버만 이 작업을 할 수 있습니다.
zh_hant: 只有這個群組的成員可以執行此操作。

# backend.error.message_receive_failed
source: Couldn’t receive a message. Try again later.
ja: メッセージを受信できませんでした。しばらくしてからもう一度お試しください。
ko: 메시지를 받지 못했습니다. 잠시 후 다시 시도해 주세요.
zh_hant: 無法接收訊息，請稍後再試。

# backend.error.no_active_room
source: There is no group to send the message to.
ja: メッセージを送信するグループがありません。
ko: 메시지를 보낼 그룹이 없습니다.
zh_hant: 沒有可傳送訊息的群組。

# backend.error.owner_cannot_remove_self
source: The group owner can’t remove themselves.
ja: グループオーナー自身は削除できません。
ko: 방장 본인은 내보낼 수 없습니다.
zh_hant: 群組擁有者無法移除自己。

# backend.error.owner_required
source: Only the group owner can do that.
ja: この操作はグループオーナーのみ実行できます。
ko: 방장만 이 작업을 할 수 있습니다.
zh_hant: 只有群組擁有者可以執行此操作。

# backend.error.profile_required
source: Save your profile first.
ja: 先にプロフィールを保存してください。
ko: 프로필을 먼저 저장해 주세요.
zh_hant: 請先儲存個人檔案。

# backend.error.realtime_unavailable
source: The real-time connection isn’t ready.
ja: リアルタイム接続の準備ができていません。
ko: 실시간 연결이 준비되지 않았습니다.
zh_hant: 即時連線尚未就緒。

# backend.error.room_limit_reached
source: Each person can use up to 5 groups.
ja: 1人につき最大5個のグループを利用できます。
ko: 한 사용자는 그룹을 최대 5개까지 사용할 수 있습니다.
zh_hant: 每位使用者最多可以使用 5 個群組。

# backend.error.room_resync_failed
source: Couldn’t synchronize the group state. Try again later.
ja: グループの状態を同期できませんでした。しばらくしてからもう一度お試しください。
ko: 그룹 상태를 동기화하지 못했습니다. 잠시 후 다시 시도해 주세요.
zh_hant: 無法同步群組狀態，請稍後再試。

# backend.error.session_recovery_failed
source: Couldn’t restore your previous sign-in session. No new account was created. Sign in again or contact support.
ja: 以前のサインインセッションを復元できませんでした。新しいアカウントは作成されていません。もう一度サインインするか、サポートにお問い合わせください。
ko: 기존 로그인 세션을 복구하지 못했습니다. 새 계정은 만들지 않았으니 다시 로그인하거나 지원을 요청해 주세요.
zh_hant: 無法恢復先前的登入工作階段。系統並未建立新帳號，請重新登入或聯絡支援。

# backend.error.stale_realtime_epoch
source: Group permissions changed, so the real-time connection needs to be refreshed.
ja: グループの権限が変更されたため、リアルタイム接続を更新する必要があります。
ko: 그룹 권한이 변경되어 실시간 연결을 새로 고쳐야 합니다.
zh_hant: 群組權限已變更，需要重新整理即時連線。

# backend.realtime_recovery_failed
source: Couldn’t restore the real-time connection: %@
ja: リアルタイム接続を復元できませんでした：%@
ko: 실시간 연결 복구 실패: %@
zh_hant: 無法恢復即時連線：%@

# build_review.error.relaunch_instructions
source: Open it again with scripts/macos/open_current.sh, or build and run it from Xcode.
ja: scripts/macos/open_current.shで開き直すか、Xcodeでビルドして実行してください。
ko: scripts/macos/open_current.sh로 다시 열거나 Xcode에서 빌드 후 실행해 주세요.
zh_hant: 請使用 scripts/macos/open_current.sh 重新開啟，或在 Xcode 中建置後執行。

# build_review.error.unverified_source
source: Couldn’t verify that this app was built from the current source.
ja: 現在のソースからビルドされたアプリか確認できません。
ko: 현재 소스로 빌드한 앱인지 확인할 수 없습니다.
zh_hant: 無法確認此 App 是否由目前的原始碼建置。

# character.pixel_cat.name
source: Kitten
ja: 子猫
ko: 아기 고양이
zh_hant: 小貓

# character.pixel_cat.palette
source: Smoke Gray · Cream · Lilac
ja: スモークグレー · クリーム · ライラック
ko: 스모크 그레이 · 크림 · 라일락
zh_hant: 煙灰 · 奶油 · 淡紫

# character.pixel_chinchilla.name
source: Baby Chinchilla
ja: こどもチンチラ
ko: 아기 친칠라
zh_hant: 龍貓寶寶

# character.pixel_chinchilla.palette
source: Cool Gray · Cream · Sky Blue
ja: クールグレー · クリーム · スカイブルー
ko: 쿨 그레이 · 크림 · 스카이 블루
zh_hant: 冷灰 · 奶油 · 天空藍

# character.pixel_duck.name
source: Duck
ja: アヒル
ko: 오리
zh_hant: 鴨子

# character.pixel_guinea_pig.name
source: Baby Guinea Pig
ja: こどもモルモット
ko: 아기 기니피그
zh_hant: 天竺鼠寶寶

# character.pixel_guinea_pig.palette
source: Brown · Caramel · Cream
ja: ブラウン · キャラメル · クリーム
ko: 브라운 · 캐러멜 · 크림
zh_hant: 棕色 · 焦糖 · 奶油

# character.pixel_hamster.name
source: Baby Hamster
ja: こどもハムスター
ko: 아기 햄스터
zh_hant: 倉鼠寶寶

# character.pixel_hamster.palette
source: Golden · Cream · Periwinkle
ja: ゴールド · クリーム · ペリウィンクル
ko: 골든 · 크림 · 페리윙클
zh_hant: 金色 · 奶油 · 長春花藍

# character.pixel_monkey.name
source: Baby Monkey
ja: こざる
ko: 아기 원숭이
zh_hant: 小猴子

# character.pixel_monkey.palette
source: Warm Brown · Peach · Cyan
ja: ウォームブラウン · ピーチ · シアン
ko: 웜 브라운 · 피치 · 시안
zh_hant: 暖棕 · 蜜桃 · 青色

# character.pixel_otter.name
source: Baby Otter
ja: こどもカワウソ
ko: 아기 수달
zh_hant: 水獺寶寶

# character.pixel_otter.palette
source: Brown · Cream · Purple
ja: ブラウン · クリーム · パープル
ko: 브라운 · 크림 · 보라
zh_hant: 棕色 · 奶油 · 紫色

# character.pixel_penguin.name
source: Baby Penguin
ja: こどもペンギン
ko: 아기 펭귄
zh_hant: 企鵝寶寶

# character.pixel_penguin.palette
source: Navy · Cream · Mint
ja: ネイビー · クリーム · ミント
ko: 네이비 · 크림 · 민트
zh_hant: 海軍藍 · 奶油 · 薄荷

# character.pixel_pig.name
source: Baby Pig
ja: こぶた
ko: 아기 돼지
zh_hant: 小豬寶寶

# character.pixel_pig.palette
source: Pink · Cream · Purple
ja: ピンク · クリーム · パープル
ko: 핑크 · 크림 · 보라
zh_hant: 粉紅 · 奶油 · 紫色

# character.pixel_poop.name
source: Poop
ja: うんち
ko: 똥
zh_hant: 便便

# character.pixel_puppy.name
source: Puppy
ja: 子犬
ko: 아기 강아지
zh_hant: 小狗

# character.pixel_puppy.palette
source: Caramel · Cream · Sky Blue
ja: キャラメル · クリーム · スカイブルー
ko: 캐러멜 · 크림 · 스카이 블루
zh_hant: 焦糖 · 奶油 · 天空藍

# character.pixel_quokka.name
source: Quokka
ja: クオッカ
ko: 쿼카
zh_hant: 短尾矮袋鼠

# character.pixel_rabbit.name
source: Baby Rabbit
ja: こうさぎ
ko: 아기 토끼
zh_hant: 小兔子

# character.pixel_rabbit.palette
source: Ivory · Peach · Lavender
ja: アイボリー · ピーチ · ラベンダー
ko: 아이보리 · 피치 · 라벤더
zh_hant: 象牙白 · 蜜桃 · 薰衣草

# character.pixel_shiba.name
source: Shiba Inu
ja: 柴犬
ko: 시바견
zh_hant: 柴犬

# character.pixel_starlight_upalupa.name
source: Starlight Axolotl
ja: 星明かりのウーパールーパー
ko: 별빛 우파루파
zh_hant: 星光六角恐龍

# character.pixel_starlight_upalupa.palette
source: Pearl Pink · Lavender · Mint
ja: パールピンク · ラベンダー · ミント
ko: 진주빛 핑크 · 라벤더 · 민트
zh_hant: 珠光粉紅 · 薰衣草 · 薄荷

# character.pixel_tree.name
source: Little Tree
ja: 小さな木
ko: 나무
zh_hant: 小樹

# character.pixel_tree.palette
source: Green · Brown · Purple
ja: グリーン · ブラウン · パープル
ko: 초록 · 브라운 · 보라
zh_hant: 綠色 · 棕色 · 紫色

# character.pixel_tteokbokki.name
source: Tteokbokki
ja: トッポッキ
ko: 떡볶이
zh_hant: 辣炒年糕

# character.unknown.name
source: Character
ja: キャラクター
ko: 캐릭터
zh_hant: 角色

# commerce.character.equip.failed
source: Couldn’t equip the character: %@
ja: キャラクターを装備できませんでした：%@
ko: 캐릭터를 장착하지 못했습니다: %@
zh_hant: 無法裝備角色：%@

# commerce.character.equip.success
source: Equipped %@.
ja: %@を装備しました。
ko: %@ 캐릭터를 장착했습니다.
zh_hant: 已裝備 %@。

# commerce.equipment.success.default_bubble
source: Equipped the default speech bubble.
ja: デフォルトの吹き出しを装備しました。
ko: 기본 말풍선을 장착했습니다.
zh_hant: 已裝備預設對話框。

# commerce.equipment.success.default_character
source: Equipped the default character.
ja: デフォルトのキャラクターを装備しました。
ko: 기본 캐릭터를 장착했습니다.
zh_hant: 已裝備預設角色。

# commerce.equipment.success.default_throwable
source: Equipped the default soft ball.
ja: デフォルトのやわらかボールを装備しました。
ko: 기본 말랑공을 장착했습니다.
zh_hant: 已裝備預設軟球。

# commerce.equipment.success.named
source: Equipped %@.
ja: %@を装備しました。
ko: %@ 장착했습니다.
zh_hant: 已裝備 %@。

# commerce.error.catalog_unavailable
source: Couldn’t load the store status.
ja: ストアの状態を読み込めませんでした。
ko: 상점 상태를 불러오지 못했습니다.
zh_hant: 無法載入商店狀態。

# commerce.kind.bubble
source: Bubbles
ja: 吹き出し
ko: 말풍선
zh_hant: 對話框

# commerce.kind.character
source: Characters
ja: キャラクター
ko: 캐릭터
zh_hant: 角色

# commerce.kind.throwable
source: Throwables
ja: 投げアイテム
ko: 투척물
zh_hant: 投擲物

# common.cancel
source: Cancel
ja: キャンセル
ko: 취소
zh_hant: 取消

# common.close
source: Close
ja: 閉じる
ko: 닫기
zh_hant: 關閉

# common.continue
source: Continue
ja: 続ける
ko: 계속
zh_hant: 繼續

# common.dismiss
source: Dismiss
ja: 閉じる
ko: 닫기
zh_hant: 關閉

# common.next
source: Next
ja: 次へ
ko: 다음
zh_hant: 下一步

# common.quit
source: Quit
ja: 終了
ko: 종료
zh_hant: 結束

# common.retry
source: Try Again
ja: 再試行
ko: 다시 시도
zh_hant: 再試一次

# common.save
source: Save
ja: 保存
ko: 저장
zh_hant: 儲存

# composer.drag.accessibility
source: Move composer handle
ja: 入力欄移動ハンドル
ko: 입력창 이동 손잡이
zh_hant: 移動輸入框控制點

# composer.drag.tooltip
source: Move Composer
ja: 入力欄を移動
ko: 입력창 이동
zh_hant: 移動輸入框

# configuration.error.incomplete_environment
source: Set both SIDEY_SUPABASE_URL and SIDEY_SUPABASE_PUBLISHABLE_KEY.
ja: SIDEY_SUPABASE_URLとSIDEY_SUPABASE_PUBLISHABLE_KEYの両方を設定してください。
ko: SIDEY_SUPABASE_URL과 SIDEY_SUPABASE_PUBLISHABLE_KEY를 모두 설정해야 합니다.
zh_hant: 請同時設定 SIDEY_SUPABASE_URL 與 SIDEY_SUPABASE_PUBLISHABLE_KEY。

# configuration.error.missing_development_configuration
source: Sidey-dev requires the SIDEY-staging URL and publishable key.
ja: Sidey-devにはSIDEY-stagingのURLとpublishable keyが必要です。
ko: Sidey-dev에는 SIDEY-staging URL과 publishable key가 필요합니다.
zh_hant: Sidey-dev 需要 SIDEY-staging URL 與 publishable key。

# configuration.error.production_backend_in_development
source: Sidey-dev can’t connect to the production Supabase project.
ja: Sidey-devは本番環境のSupabaseプロジェクトに接続できません。
ko: Sidey-dev는 production Supabase 프로젝트에 연결할 수 없습니다.
zh_hant: Sidey-dev 無法連線至正式環境的 Supabase 專案。

# configuration.error.secret_key_not_allowed
source: A Supabase secret or service-role key can’t be used in the client.
ja: クライアントではSupabaseのsecret/service-roleキーを使用できません。
ko: 클라이언트에 Supabase secret/service-role 키를 사용할 수 없습니다.
zh_hant: 用戶端不可使用 Supabase secret/service-role 金鑰。

# configuration.error.unsupported_realtime_protocol
source: The SIDEY real-time protocol setting contains an unsupported value.
ja: SIDEYのリアルタイムプロトコル設定に対応していない値が指定されています。
ko: SIDEY 실시간 프로토콜 설정이 지원되지 않는 값입니다.
zh_hant: SIDEY 即時通訊協定設定含有不支援的值。

# connection.state.connecting
source: Connecting…
ja: 接続中…
ko: 연결 중…
zh_hant: 連線中…

# connection.state.failed
source: Connection error
ja: 接続エラー
ko: 연결 오류
zh_hant: 連線錯誤

# connection.state.idle
source: Idle
ja: 待機中
ko: 대기 중
zh_hant: 待機中

# connection.state.online
source: Connected
ja: 接続済み
ko: 연결됨
zh_hant: 已連線

# debug.build.dirty
source: Uncommitted changes
ja: 未コミットの変更
ko: 미커밋 변경
zh_hant: 未提交的變更

# firebase.auth.error.account_mismatch
source: The Firebase account doesn’t match the current SIDEY account.
ja: Firebase認証アカウントが現在のSIDEYアカウントと一致しません。
ko: Firebase 인증 계정이 현재 SIDEY 계정과 일치하지 않습니다.
zh_hant: Firebase 驗證帳號與目前的 SIDEY 帳號不符。

# firebase.auth.error.invalid_rollout_lease_claim
source: Couldn’t verify the Firebase rollout lease claim.
ja: Firebase rollout leaseのclaimを確認できませんでした。
ko: Firebase rollout lease claim을 확인할 수 없습니다.
zh_hant: 無法確認 Firebase rollout lease 的 claim。

# firebase.auth.error.invalid_session_claim
source: Couldn’t verify the Firebase authentication session claim.
ja: Firebase認証セッションのclaimを確認できませんでした。
ko: Firebase 인증 세션 claim을 확인할 수 없습니다.
zh_hant: 無法確認 Firebase 驗證工作階段的 claim。

# firebase.auth.error.login_mismatch
source: The Firebase authentication session doesn’t match the current SIDEY login.
ja: Firebase認証セッションが現在のSIDEYログインと一致しません。
ko: Firebase 인증 세션이 현재 SIDEY 로그인과 일치하지 않습니다.
zh_hant: Firebase 驗證工作階段與目前的 SIDEY 登入不符。

# firebase.auth.error.malformed_account_identifier
source: The Firebase account identifier is invalid.
ja: Firebase認証アカウントの識別子が正しくありません。
ko: Firebase 인증 계정 식별자가 올바르지 않습니다.
zh_hant: Firebase 驗證帳號識別碼無效。

# firebase.auth.error.rollout_lease_expired
source: The Firebase real-time rollout lease has expired.
ja: Firebaseのリアルタイムrollout leaseの有効期限が切れました。
ko: Firebase 실시간 rollout lease가 만료되었습니다.
zh_hant: Firebase 即時 rollout lease 已到期。

# firebase.auth.error.rollout_lease_mismatch
source: The Firebase rollout lease doesn’t match the bootstrap response.
ja: Firebase rollout leaseがbootstrap応答と一致しません。
ko: Firebase rollout lease가 bootstrap 응답과 일치하지 않습니다.
zh_hant: Firebase rollout lease 與 bootstrap 回應不符。

# firebase.auth.error.session_mismatch
source: The Firebase authentication session doesn’t match the current SIDEY login session.
ja: Firebase認証セッションが現在のSIDEYログインセッションと一致しません。
ko: Firebase 인증 세션이 현재 SIDEY 로그인 세션과 일치하지 않습니다.
zh_hant: Firebase 驗證工作階段與目前的 SIDEY 登入工作階段不符。

# firebase.auth.error.token_refresh_validation_failed
source: Couldn’t validate the refreshed Firebase credentials.
ja: 更新されたFirebase認証情報を検証できませんでした。
ko: Firebase 갱신 인증 정보를 검증할 수 없습니다.
zh_hant: 無法驗證更新後的 Firebase 驗證資訊。

# firebase.bootstrap.error.authentication_required
source: Sign in again to connect to Firebase real-time services.
ja: Firebaseのリアルタイム接続を使用するには、もう一度ログインしてください。
ko: Firebase 실시간 연결을 위해 다시 로그인해야 합니다.
zh_hant: 請重新登入以連線 Firebase 即時服務。

# firebase.bootstrap.error.grant_not_converged
source: Firebase real-time access isn’t ready yet.
ja: Firebaseのリアルタイム権限はまだ準備できていません。
ko: Firebase 실시간 권한이 아직 준비되지 않았습니다.
zh_hant: Firebase 即時存取權限尚未準備完成。

# firebase.bootstrap.error.invalid_argument
source: The Firebase bootstrap request is invalid.
ja: Firebase bootstrapリクエストの形式が正しくありません。
ko: Firebase bootstrap 요청 형식이 올바르지 않습니다.
zh_hant: Firebase bootstrap 請求格式無效。

# firebase.bootstrap.error.invalid_http_response
source: Couldn’t verify the Firebase bootstrap response.
ja: Firebase bootstrap応答を確認できませんでした。
ko: Firebase bootstrap 응답을 확인할 수 없습니다.
zh_hant: 無法確認 Firebase bootstrap 回應。

# firebase.bootstrap.error.malformed_success
source: Couldn’t interpret the successful Firebase bootstrap response.
ja: Firebase bootstrapの成功応答を解析できませんでした。
ko: Firebase bootstrap 성공 응답을 해석할 수 없습니다.
zh_hant: 無法解析 Firebase bootstrap 成功回應。

# firebase.bootstrap.error.method_not_allowed
source: The Firebase bootstrap request method doesn’t match the server contract.
ja: Firebase bootstrapのリクエスト方式がサーバー契約と一致しません。
ko: Firebase bootstrap 요청 방식이 서버 계약과 일치하지 않습니다.
zh_hant: Firebase bootstrap 請求方式與伺服器合約不符。

# firebase.bootstrap.error.missing_access_token
source: A Supabase login session is required to start the Firebase real-time connection.
ja: Supabaseのログインセッションがないため、Firebaseのリアルタイム接続を開始できません。
ko: Supabase 로그인 세션이 없어 Firebase 실시간 연결을 시작할 수 없습니다.
zh_hant: 缺少 Supabase 登入工作階段，無法啟動 Firebase 即時連線。

# firebase.bootstrap.error.rate_limited
source: Too many Firebase real-time connection requests. Try again shortly.
ja: Firebaseのリアルタイム接続リクエストが多すぎます。しばらくしてからもう一度お試しください。
ko: Firebase 실시간 연결 요청이 너무 많습니다. 잠시 뒤 다시 시도해 주세요.
zh_hant: Firebase 即時連線請求過多。請稍後再試。

# firebase.bootstrap.error.rollout_disabled
source: Firebase real-time rollout approval has expired or been suspended.
ja: Firebaseのリアルタイムrollout承認が期限切れになったか停止されました。
ko: Firebase 실시간 rollout 승인이 만료되었거나 중지되었습니다.
zh_hant: Firebase 即時 rollout 核准已到期或已暫停。

# firebase.bootstrap.error.unavailable
source: Couldn’t prepare the Firebase real-time connection.
ja: Firebaseのリアルタイム接続を準備できませんでした。
ko: Firebase 실시간 연결을 준비할 수 없습니다.
zh_hant: 無法準備 Firebase 即時連線。

# firebase.bootstrap.error.unexpected_contract
source: The Firebase bootstrap response doesn’t match this app’s real-time contract.
ja: Firebase bootstrap応答がこのアプリのリアルタイム契約と一致しません。
ko: Firebase bootstrap 응답이 이 앱의 실시간 계약과 일치하지 않습니다.
zh_hant: Firebase bootstrap 回應與此 App 的即時合約不符。

# firebase.chat.error.authentication_expired
source: Firebase chat authentication has expired.
ja: Firebaseチャットの認証期限が切れました。
ko: Firebase 채팅 인증이 만료되었습니다.
zh_hant: Firebase 聊天驗證已到期。

# firebase.chat.error.invalid_message
source: The message format is invalid.
ja: メッセージの形式が正しくありません。
ko: 메시지 형식이 올바르지 않습니다.
zh_hant: 訊息格式無效。

# firebase.chat.error.permission_denied
source: You don’t have permission to send messages in this room.
ja: このルームにメッセージを送信する権限がありません。
ko: 이 방에 메시지를 보낼 권한이 없습니다.
zh_hant: 你沒有權限在此聊天室傳送訊息。

# firebase.chat.error.rate_limited
source: You’re sending messages too quickly.
ja: メッセージの送信が速すぎます。
ko: 메시지를 너무 빠르게 보내고 있습니다.
zh_hant: 訊息傳送得太快了。

# firebase.chat.error.state_conflict
source: The message state conflicts with the server state.
ja: メッセージの状態がサーバーと競合しています。
ko: 메시지 상태가 서버와 충돌했습니다.
zh_hant: 訊息狀態與伺服器發生衝突。

# firebase.configuration.error.invalid_plist
source: Couldn’t read the App Store Firebase configuration file.
ja: App Store用Firebase設定ファイルを読み込めませんでした。
ko: App Store Firebase 설정 파일을 읽을 수 없습니다.
zh_hant: 無法讀取 App Store Firebase 設定檔。

# firebase.configuration.error.missing_plist
source: The App Store Firebase configuration file is missing from the app bundle.
ja: App Store用Firebase設定ファイルがアプリバンドルにありません。
ko: App Store Firebase 설정 파일이 번들에 없습니다.
zh_hant: App bundle 中缺少 App Store Firebase 設定檔。

# firebase.configuration.error.sdk_app_unavailable
source: Couldn’t initialize the Firebase SDK app.
ja: Firebase SDKアプリを初期化できませんでした。
ko: Firebase SDK app을 초기화할 수 없습니다.
zh_hant: 無法初始化 Firebase SDK App。

# firebase.configuration.error.sdk_options_unavailable
source: Couldn’t create the Firebase SDK configuration.
ja: Firebase SDKの設定を作成できませんでした。
ko: Firebase SDK 설정을 생성할 수 없습니다.
zh_hant: 無法建立 Firebase SDK 設定。

# firebase.configuration.error.unexpected_app
source: The Firebase configuration doesn’t match the registered App Store app.
ja: Firebase設定が登録済みのApp Storeアプリと一致しません。
ko: Firebase 설정이 등록된 App Store app과 일치하지 않습니다.
zh_hant: Firebase 設定與已註冊的 App Store App 不符。

# firebase.configuration.error.unexpected_bundle
source: The Firebase configuration doesn’t match the running App Store bundle ID.
ja: Firebase設定が実行中のApp Store bundle IDと一致しません。
ko: Firebase 설정과 실행 중인 App Store bundle ID가 일치하지 않습니다.
zh_hant: Firebase 設定與目前執行中的 App Store bundle ID 不符。

# firebase.configuration.error.unexpected_database
source: The Firebase configuration doesn’t point to the active SIDEY Realtime Database.
ja: Firebase設定が有効なSIDEY Realtime Databaseを参照していません。
ko: Firebase 설정이 active SIDEY Realtime Database를 가리키지 않습니다.
zh_hant: Firebase 設定未指向目前使用中的 SIDEY Realtime Database。

# firebase.configuration.error.unexpected_project
source: The Firebase configuration doesn’t point to the SIDEY production project.
ja: Firebase設定がSIDEYの本番プロジェクトを参照していません。
ko: Firebase 설정이 SIDEY production project를 가리키지 않습니다.
zh_hant: Firebase 設定未指向 SIDEY 正式環境專案。

# firebase.production.error.app_version_unavailable
source: Couldn’t register the real-time rollout policy because the app version couldn’t be determined.
ja: アプリのバージョンを確認できないため、リアルタイムrolloutポリシーを登録できませんでした。
ko: 앱 버전을 확인할 수 없어 실시간 전환 정책을 등록하지 못했습니다.
zh_hant: 無法確認 App 版本，因此無法註冊即時 rollout 政策。

# firebase.production.error.duplicate_wire_code
source: Duplicate Firebase real-time product codes prevent a secure connection.
ja: Firebaseのリアルタイム商品コードが重複しているため、安全に接続できません。
ko: Firebase 실시간 상품 코드가 중복되어 안전하게 연결할 수 없습니다.
zh_hant: Firebase 即時商品代碼重複，無法安全連線。

# firebase.transport.error.access_grant_closed
source: The Firebase real-time access refresh isn’t complete yet.
ja: Firebaseのリアルタイム権限の更新がまだ完了していません。
ko: Firebase 실시간 권한 갱신이 아직 완료되지 않았습니다.
zh_hant: Firebase 即時權限更新尚未完成。

# firebase.transport.error.listener_failed
source: Couldn’t maintain the Firebase real-time listener.
ja: Firebaseのリアルタイム受信接続を維持できませんでした。
ko: Firebase 실시간 수신 연결을 유지하지 못했습니다.
zh_hant: 無法維持 Firebase 即時接收連線。

# firebase.transport.error.live_listener_unavailable
source: Couldn’t prepare the Firebase room listener.
ja: Firebaseのルーム受信接続を準備できませんでした。
ko: Firebase 방 수신 연결을 준비할 수 없습니다.
zh_hant: 無法準備 Firebase 聊天室接收連線。

# firebase.transport.error.reconciliation_failed
source: Couldn’t recheck the server state after the real-time change.
ja: リアルタイム変更後のサーバー状態を再確認できませんでした。
ko: 실시간 변경 후 서버 상태를 다시 확인하지 못했습니다.
zh_hant: 即時狀態變更後，無法重新確認伺服器狀態。

# firebase.transport.error.room_not_authorized
source: This room can’t be opened with the current Firebase access.
ja: 現在のFirebase権限ではこのルームを開けません。
ko: 현재 Firebase 권한으로 이 방을 열 수 없습니다.
zh_hant: 目前的 Firebase 權限無法開啟此聊天室。

# firebase.transport.error.shut_down
source: The Firebase real-time connection has ended.
ja: Firebaseのリアルタイム接続が終了しました。
ko: Firebase 실시간 연결이 종료되었습니다.
zh_hant: Firebase 即時連線已結束。

# group.create.action
source: Create Group
ja: グループを作成
ko: 그룹 만들기
zh_hant: 建立群組

# group.create.in_progress
source: Creating…
ja: 作成中…
ko: 만드는 중…
zh_hant: 建立中…

# group.create.keychain_warning
source: The group was created, but the invite code couldn’t be saved to Keychain. Save the code shown now somewhere safe.
ja: グループは作成されましたが、招待コードをキーチェーンに保存できませんでした。現在表示されているコードを別の安全な場所に保管してください。
ko: 그룹은 생성됐지만 초대 코드를 키체인에 저장하지 못했습니다. 지금 표시된 코드를 따로 보관해 주세요.
zh_hant: 群組已建立，但無法將邀請碼儲存至鑰匙圈。請另外妥善保存目前顯示的邀請碼。
